name = input("Ваше ім'я? ")
surname = input("Ваше прізвище? ")
father = input("Ваше ім'я по батькові? ")
land = input("Ваша країна? ")
laand = input("Ваше Місто? ")
laaand = input("Ваша вулиця? ")
house = input("Ваш будинок? ")
flat = input("Ваша квартира? (Якщо є) ")
age = input("Ваш вік? ")
ill = input("У вас є хвороби? ")
long = input("Ваш ріст? ")
print("Тепер буде тестування на розум.")
test1 = input("Найбільша країна Європи ")
while True:
    if test1 == "Україна":
            print("Правильно")
            break
    elif test1 == "Росія":
        print("Боже, яке кончене!")
        break
    else:
        print("Не розумію. Здається у вас неправильно, або ви написали з маленької букви.")
        test1 = input("Найбільша країна Європи ")
test2 = input("Найсильніша тварна України ")
while True:
    if test2 == "Селезень, Гусак":
            print("Правильно")
            break
    elif test1 == "Свиня":
        print("Вона була найкрутішою, а тепер ні.")
        test2 = input("Найсильніша тварна України ")
    else:
        print("Не розумію. Здається у вас неправильно, або ви написали з маленької букви.")
        test2 = input("Найсильніша тварна України ")